
local CC={
  COMBAT_START = 1,
  COMBAT_UNIT_ACTION_FINISH = 2,
  
  SCORE_NORMAL_HIT = 10,
  SCORE_NORMAL_AVO = 20,
  SCORE_NORMAL_ACC = 30,
  SCORE_NORMAL_PAR = 40,
  SCORE_NORMAL_CRI = 50,
  SCORE_NORMAL_TOU = 60,
  SCORE_NORMAL_ATK = 70,
  SCORE_NORMAL_DEF = 80,
  
  dmg_score ={1,2,5,3,4,6},
  
  RESULT_WIN = 1,
  RESULT_LOSE = 0,
  
  COMBAT_CAMP_ACTIVE = 1,
  COMBAT_CAMP_PASSIVE = 2,
  
  EXTRAATTR_GENDER = 1,
  EXTRAATTR_GOOD = 2,
  EXTRAATTR_CONFIG_ID = 3,
  
  SKILL_SCRIPT_CALL_DAMAGE = 1,
  SKILL_SCRIPT_CALL_SKILL_DONE = 2,
  SKILL_SCRIPT_CALL_CHIEF_DODGE = 3,
  
  MOVE_NORMAL = 1,
  MOVE_TELEPORT = 2,
  MOVE_JUMP = 3,
  MOVE_RUSH = 4,
  
  STATUS_NOTMOVE = 1,       --stop move
  STATUS_NOTACTION = 2,     --stop skill
  STATUS_NOTROUND = 3,      --skip turn
  STATUS_IGNOREJOINT = 4,   --move free
  STATUS_UNBENDING = 5,     --die hard
  
  FIGHT_ATTR_WUXUE = 0, --武学值 用于标记通用强度怪物的武器类型
  FIGHT_ATTR_SZHAN = 1, --实战值 用于区分怪物等级类型
  
  FIGHT_ATTR_HP = 3,   -- 生命值
  FIGHT_ATTR_MP = 4,   -- 内力值
  FIGHT_ATTR_MOVE = 5, -- 速度值 每10点移动格数+1
  FIGHT_ATTR_STR = 6,    -- 硬功
  FIGHT_ATTR_DEX = 7,    -- 软功
  FIGHT_ATTR_PWR = 8,    -- 内功
  FIGHT_ATTR_EYE = 9,    -- 眼功
  FIGHT_ATTR_SPD = 10,   -- 轻功
  FIGHT_ATTR_EAR = 11,   -- 耳功
  FIGHT_ATTR_ATK = 12,   -- 攻击值
  FIGHT_ATTR_DEF = 13,   -- 防御值
  FIGHT_ATTR_HIT = 14,   -- 命中值
  FIGHT_ATTR_AVO = 15,   -- 闪避值
  FIGHT_ATTR_CRI = 16,   -- 暴击值
  FIGHT_ATTR_TOU = 17,   -- 韧性值
  FIGHT_ATTR_ACC = 18,   -- 精准值
  FIGHT_ATTR_PAR = 19,   -- 招架值
  FIGHT_ATTR_DMG = 20,   -- 伤害值
  FIGHT_ATTR_QIFANG = 21,  -- 气防
  FIGHT_ATTR_FANJI = 22,    -- 反击
  FIGHT_ATTR_LIANJI = 23,  -- 连击
  FIGHT_ATTR_DUGONG = 24,  -- 毒功
  FIGHT_ATTR_HPMAX = 27, --生命上限属性
  FIGHT_ATTR_MPMAX = 28, --内力上限属性
  LEVEL_MARK_ATTR = 25,
  
  FACE_RIGHT_UP = 1,     --Y轴 -
  FACE_RIGHT_DOWN = 2,     --X轴 +
  FACE_LEFT_DOWN = 3,      --Y轴 +
  FACE_LEFT_UP = 4,      --X轴 -
  
  AREA_STRAIT = 100,
  AREA_SINGLE = 101,
  AREA_ACROSS = 102,
  AREA_FLOWER = 103,
  AREA_TRIANG = 104,
  AREA_AROUND = 105,
  DMG_KNIFE = 1001,
  DMG_SWORD = 1002,
  DMG_STICK = 1003,
  DMG_FIST = 1004,
  DMG_DART = 1005,
  DMG_POWER = 1006,
  
  START_TIME = 0,
  TP2HH = 4 * 10,        --1时辰的时间点（TIME POINT）
  TP2DD = 6 * 4 * 10,     --1天
  TP2MM = 3 * 6 * 4 * 10,     --1月
  TP2YY = 12 * 3 * 6 * 4 * 10,      --1年
  
  --单位性别
  GENDER_MALE = 101,
  GENDER_FEMALE = 100,

  AI_MODE_SKILL_0 = 10,
  AI_MODE_SKILL_1 = 20,
  AI_MODE_SKILL_2 = 30,
  AI_MODE_SKILL_3 = 40,
  AI_MODE_SKILL_0_1 = 2,
  AI_MODE_SKILL_0_1_2 = 3,
  AI_MODE_SKILL_0_1_2_3 = 4,
  
  DROP_INSTANTLY = 1,
  DROP_AFTER_BATTLE = 0
  
  
}

local function initNpcUnits()
  local npcUnits={}
  npcUnits[1]=2101012   --荆棘
  npcUnits[2]=2101052   --谷月轩
  npcUnits[3]=2101021   --醉仙
  npcUnits[4]=2101017   --橘叟
  npcUnits[5]=2101064   --傅剑寒
  npcUnits[6]=2101006   --方云华
  npcUnits[7]=2101030   --虚真
  npcUnits[8]=2101016   --花翁
  npcUnits[9]=2101001   --仙音
  npcUnits[10]=2101056  --高胜
  npcUnits[11]=2101018  --神医
  npcUnits[12]=2101019  --怪医
  npcUnits[13]=2101060  --任剑南
  npcUnits[14]=2101048  --沈丘山
  npcUnits[15]=2101033  --夏侯非
  npcUnits[16]=2101068  --万凯
  npcUnits[17]=2101015  --丹青
  npcUnits[18]=2101057  --叶孤
  npcUnits[19]=2101045  --古实
  npcUnits[20]=2101058  --萧遥
  npcUnits[21]=2101005  --关伟
  npcUnits[22]=2101025  --喝
  npcUnits[23]=2101020  --书生
  npcUnits[24]=2101024  --吃
  npcUnits[25]=2101037  --巩光杰
  npcUnits[26]=2101059  --商仲仁
  npcUnits[27]=2101002  --江瑜
  npcUnits[28]=2101063  --任清璇
  npcUnits[29]=2101069  --杨云
  npcUnits[30]=2101039  --唐冠南
  npcUnits[31]=2101031  --丁冲
  npcUnits[32]=2101026  --嫖
  npcUnits[33]=2101003  --西门峰
  npcUnits[34]=2101053  --蓝婷
  npcUnits[35]=2101042  --纪纹
  npcUnits[36]=2101027  --赌
  npcUnits[37]=2101022  --沈湘芸
  npcUnits[38]=2101032  --史燕
  npcUnits[39]=2101007  --齐丽
  npcUnits[40]=2101004  --贾云长
  npcUnits[41]=2101049  --雷震天
  npcUnits[42]=2101051  --赵惊风
  npcUnits[43]=2101050  --赛飞鸿
  return #npcUnits, npcUnits
end
CC.npcUnitsNum, CC.npcUnits=initNpcUnits()

local function initMonUnits()
  local monUnits={}
  monUnits[1]=2200001
  monUnits[2]=2200002
  monUnits[3]=2200003
  monUnits[4]=2200004
  monUnits[5]=2210004
  monUnits[6]=2200005
  monUnits[7]=2210005
  monUnits[8]=2220005
  monUnits[9]=2200006
  monUnits[10]=2200007
  monUnits[11]=2200008
  monUnits[12]=2200009
  monUnits[13]=2200017
  monUnits[14]=2200018
  monUnits[15]=2200019
  monUnits[16]=2200020
  monUnits[17]=2200021
  monUnits[18]=2200022
  monUnits[19]=2300046
  monUnits[20]=2300208
  monUnits[21]=2300218
  monUnits[22]=2310218
  monUnits[23]=2300216
  monUnits[24]=2300603
  monUnits[25]=2310603
  monUnits[26]=2300427
  monUnits[27]=2300664
  monUnits[28]=2300665
  monUnits[29]=2300429
  return #monUnits, monUnits
end
CC.monUnitsNum, CC.monUnits = initMonUnits()

local function init_hero_power()
  local hero_power={}
  hero_power[2101010]={125,155,123,138,140,122}
  hero_power[2101023]={130,113,101,116,101,103}
  hero_power[2101054]={97,110,99,110,123,101}
  hero_power[2101034]={111,98,121,95,108,98}
  hero_power[2101055]={123,95,112,98,108,98}
  hero_power[2101052]={106,107,117,94,91,95}
  hero_power[2101012]={117,104,94,93,103,95}
  hero_power[2200023]={90,100,89,102,111,90}
  hero_power[2101044]={113,102,90,92,91,100}
  hero_power[2101046]={101,87,89,89,109,99}
  hero_power[2101021]={87,86,88,97,108,99}
  hero_power[2101017]={85,107,98,88,97,89}
  hero_power[2101011]={83,82,96,86,93,107}
  hero_power[2101009]={82,81,101,92,84,93}
  hero_power[2101064]={95,81,82,104,80,95}
  hero_power[2101006]={82,92,82,102,81,91}
  hero_power[2101030]={82,84,102,91,83,93}
  hero_power[2300138]={81,95,82,92,105,84}
  hero_power[2101016]={104,93,84,81,91,81}
  hero_power[2101001]={79,91,93,81,79,103}
  hero_power[2300527]={89,101,92,83,79,80}
  hero_power[2101043]={79,90,103,81,89,82}
  hero_power[2300123]={80,93,90,79,101,79}
  hero_power[2101056]={91,91,82,100,81,82}
  hero_power[2101038]={99,83,79,91,83,90}
  hero_power[2300608]={98,87,79,80,77,87}
  hero_power[2101018]={89,79,80,98,79,91}
  hero_power[2101019]={81,101,81,90,81,88}
  hero_power[2200016]={81,87,77,79,97,90}
  hero_power[2101061]={77,90,77,97,88,76}
  hero_power[2101041]={80,99,80,89,76,88}
  hero_power[2101060]={77,86,80,89,76,98}
  hero_power[2101048]={78,98,74,75,85,86}
  hero_power[2101014]={78,75,84,76,97,84}
  hero_power[2101033]={74,86,88,96,77,78}
  hero_power[2300166]={74,77,75,97,86,86}
  hero_power[2300607]={85,87,76,78,74,94}
  hero_power[2101068]={76,85,75,83,92,77}
  hero_power[2101015]={92,85,82,76,74,73}
  hero_power[2101057]={77,74,95,82,74,82}
  hero_power[2101045]={86,76,75,95,82,75}
  hero_power[2101058]={77,83,85,76,92,77}
  hero_power[2101036]={75,92,83,75,73,82}
  hero_power[2101008]={83,93,71,80,74,74}
  hero_power[2101005]={80,71,73,75,83,92}
  hero_power[2101025]={83,74,81,92,71,75}
  hero_power[2101028]={90,82,71,84,71,73}
  hero_power[2101029]={72,81,72,80,75,93}
  hero_power[2200014]={73,73,83,75,92,81}
  hero_power[2101020]={73,72,89,81,70,83}
  hero_power[2101024]={70,72,89,71,81,83}
  hero_power[2101037]={81,82,73,71,72,89}
  hero_power[2101059]={68,79,69,90,79,72}
  hero_power[2101002]={81,86,70,70,69,81}
  hero_power[2101063]={78,71,80,69,88,68}
  hero_power[2101069]={68,71,80,77,88,72}
  hero_power[2101039]={67,87,67,78,76,70}
  hero_power[2101031]={70,75,69,86,67,76}
  hero_power[2200015]={69,84,71,76,77,67}
  hero_power[2101026]={68,74,67,76,67,82}
  hero_power[2101003]={71,72,62,65,64,80}
  hero_power[2300531]={60,75,67,60,63,69}
  hero_power[2101053]={63,77,70,63,69,62}
  hero_power[2200013]={60,65,74,67,59,60}
  hero_power[2200010]={67,67,60,77,58,58}
  hero_power[2200012]={55,56,66,57,62,72}
  hero_power[2101042]={56,67,56,54,62,64}
  hero_power[2101062]={56,62,57,53,69,61}
  hero_power[2101027]={60,71,54,56,60,57}
  hero_power[2101049]={62,59,54,55,55,66}
  hero_power[2101022]={54,52,67,53,61,62}
  hero_power[2101040]={50,61,57,64,50,50}
  hero_power[2101032]={50,52,58,51,65,61}
  hero_power[2101007]={52,50,61,58,50,58}
  hero_power[2101004]={51,52,58,57,61,52}
  hero_power[2200011]={57,47,59,49,57,50}
  hero_power[2101050]={54,60,53,46,49,46}
  hero_power[2300564]={59,54,50,47,50,54}
  hero_power[2300565]={80,69,79,69,90,68}
  hero_power[2300111]={59,54,50,47,50,54}
  hero_power[2101051]={47,53,55,48,58,47}
  hero_power[2300516]={88,77,100,78,76,88}  --腾蛇  按胖弟子
  hero_power[2300517]={88,77,100,78,76,88}  --销魂  按胖弟子
  
  hero_power[2300521]={100,88,90,80,80,77}  --欧阳笑
  hero_power[2300130]={72,81,72,80,75,93}   --银钩
  hero_power[2300129]={90,82,71,84,71,73}   --铁面
  hero_power[2300520]={122,109,107,96,94,94}  --血蟾
  
  
  
  
  --刀剑棍拳暗奇 各等级段通用强度
  hero_power[1010]={66,52,59,52,59,52}
  hero_power[1020]={52,66,52,59,52,59}
  hero_power[1030]={59,52,59,52,66,52}
  hero_power[1040]={59,52,66,52,59,52}
  hero_power[1050]={52,59,52,66,52,59}
  hero_power[1060]={52,59,52,59,52,66}
  
  hero_power[2010]={76,60,68,60,68,60}
  hero_power[2020]={60,76,60,68,60,68}
  hero_power[2030]={68,60,68,60,76,60}
  hero_power[2040]={68,60,76,60,68,60}
  hero_power[2050]={60,68,60,76,60,68}
  hero_power[2060]={60,68,60,68,60,76}
  
  hero_power[2300625]={68,60,76,60,68,60}  --水蟒按20级怪
  
  hero_power[3010]={85,67,76,67,76,67}
  hero_power[3020]={67,85,67,76,67,76}
  hero_power[3030]={76,67,76,67,85,67}
  hero_power[3040]={76,67,85,67,76,67}
  hero_power[3050]={67,76,67,85,67,76}
  hero_power[3060]={67,76,67,76,67,85}
  
  hero_power[2300623]={76,67,85,67,76,67}  --鳄鱼按30级怪
  
  hero_power[4010]={95,75,85,75,85,75}
  hero_power[4020]={75,95,75,85,75,85}
  hero_power[4030]={85,75,85,75,95,75}
  hero_power[4040]={85,75,95,75,85,75}
  hero_power[4050]={75,85,75,95,75,85}
  hero_power[4060]={75,85,75,85,75,95}
  
  hero_power[2300624]={85,75,95,75,85,75}  --巨蜥按40级怪
  
  hero_power[5010]={104,82,93,82,93,82}
  hero_power[5020]={82,104,82,93,82,93}
  hero_power[5030]={93,82,93,82,104,82}
  hero_power[5040]={93,82,104,82,93,82}
  hero_power[5050]={82,93,82,104,82,93}
  hero_power[5060]={82,93,82,93,82,104}
  
  
  hero_power[6010]={114,90,102,90,102,90}
  hero_power[6020]={90,114,90,102,90,102}
  hero_power[6030]={102,90,102,90,114,90}
  hero_power[6040]={102,90,114,90,102,90}
  hero_power[6050]={90,102,90,114,90,102}
  hero_power[6060]={90,102,90,102,90,114}
  
  hero_power[7010]={123,97,110,97,110,97}
  hero_power[7020]={97,123,97,110,97,110}
  hero_power[7030]={110,97,110,97,123,97}
  hero_power[7040]={110,97,123,97,110,97}
  hero_power[7050]={97,110,97,123,97,110}
  hero_power[7060]={97,110,97,110,97,123}
  
  hero_power[8010]={133,105,119,105,119,105}
  hero_power[8020]={105,133,105,119,105,119}
  hero_power[8030]={119,105,119,105,133,105}
  hero_power[8040]={119,105,133,105,119,105}
  hero_power[8050]={105,119,105,133,105,119}
  hero_power[8060]={105,119,105,119,105,133}
  
  hero_power[9010]={142,112,127,112,127,112}
  hero_power[9020]={112,142,112,127,112,127}
  hero_power[9030]={127,112,127,112,142,112}
  hero_power[9040]={127,112,142,112,127,112}
  hero_power[9050]={112,127,112,142,112,127}
  hero_power[9060]={112,127,112,127,112,142}
  
  hero_power[10010]={152,120,136,120,136,120}
  hero_power[10020]={120,152,120,136,120,136}
  hero_power[10030]={136,120,136,120,152,120}
  hero_power[10040]={136,120,152,120,136,120}
  hero_power[10050]={120,136,120,152,120,136}
  hero_power[10060]={120,136,120,136,120,152}
    
  
  
  
  
  return hero_power
end
CC.hero_power = init_hero_power()

local function init_bad_buffs()
  local bad_buffs = {}
  for i=1,10 do
    --属性修正1
    table.insert(bad_buffs, 11100+i )
    table.insert(bad_buffs, 21100+i )
    table.insert(bad_buffs, 31100+i )
    table.insert(bad_buffs, 41100+i )
    table.insert(bad_buffs, 51100+i )
    table.insert(bad_buffs, 61100+i )
    --属性修正2
    table.insert(bad_buffs, 111100+i )
    table.insert(bad_buffs, 121100+i )
    table.insert(bad_buffs, 131100+i )
    table.insert(bad_buffs, 141100+i )
    table.insert(bad_buffs, 151100+i )
    table.insert(bad_buffs, 161100+i )
    table.insert(bad_buffs, 171100+i )
    table.insert(bad_buffs, 181100+i )
    table.insert(bad_buffs, 191100+i )
  end
  --小伙伴特殊技能
  table.insert(bad_buffs, 10020201 ) --放下屠刀
  table.insert(bad_buffs, 10030000 ) --缴械
  table.insert(bad_buffs, 10040201 ) --刀光晃眼
  table.insert(bad_buffs, 10050201 ) --春秋刀法
  table.insert(bad_buffs, 10310101 ) --缴械
  table.insert(bad_buffs, 10310201 ) --缴械
  table.insert(bad_buffs, 10330301 ) --破防绝刀
  table.insert(bad_buffs, 10520201 ) --正气凌然
  table.insert(bad_buffs, 10630201 ) --花不堪折
  return bad_buffs
end
CC.bad_buffs = init_bad_buffs()

local function init_control_buffs()
  local control_buffs = {}
  for i=1,5 do
    table.insert(control_buffs, 1000+i ) --行动
    table.insert(control_buffs, 1100+i ) --移动
    table.insert(control_buffs, 1200+i ) --普攻
    table.insert(control_buffs, 1300+i ) --招式
    table.insert(control_buffs, 1400+i ) --道具
  end
  table.insert(control_buffs, 10150401) --诗情画意
  table.insert(control_buffs, 10160201) --落花有意
  table.insert(control_buffs, 10170401) --移形换位
  table.insert(control_buffs, 10200201) --铁扇封穴
  table.insert(control_buffs, 10550302) --魅惑魔音
  table.insert(control_buffs, 10550303) --魅惑魔音
  table.insert(control_buffs, 10550401) --沉鱼落雁
  return control_buffs
end
CC.control_buffs = init_control_buffs()

local function init_dmgUP_buffs()
  local dmgUP_buffs = {}
  for i=1,10 do
    --属性修正2
    table.insert(dmgUP_buffs, 190100+i )
    table.insert(dmgUP_buffs, 10120401+i )  --魔剑噬心
  end
  --小伙伴特殊技能
  table.insert(dmgUP_buffs, 10680301) --兽血沸腾
  table.insert(dmgUP_buffs, 10600201) --千锤百炼
  table.insert(dmgUP_buffs, 10600202) --千锤百炼
  table.insert(dmgUP_buffs, 10600203) --千锤百炼
  table.insert(dmgUP_buffs, 10600204) --千锤百炼
  table.insert(dmgUP_buffs, 10600205) --千锤百炼
  table.insert(dmgUP_buffs, 10600206) --千锤百炼
  
  return dmgUP_buffs
end
CC.dmgUP_buffs = init_dmgUP_buffs()


--送礼数据
local function init_hero_hobby()
  local hero_hobby={}
  hero_hobby[1000001]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000002]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000003]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000004]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000005]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000006]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000007]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000008]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000009]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000010]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,2,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000011]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000012]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000013]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000014]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000015]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000016]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000017]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000018]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000019]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000020]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000021]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000022]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000023]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000024]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000025]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000026]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000027]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000028]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000029]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000030]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000031]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000032]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000033]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000034]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000035]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000036]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000037]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000038]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000039]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000040]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000041]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000042]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000043]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000044]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000045]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000046]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  
  hero_hobby[1000048]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000049]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000050]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000051]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000052]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000053]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000054]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000055]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000056]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000057]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000058]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000059]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000060]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000061]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000062]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000063]={1,2,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,2,1,1,1,1.5,1,0.5,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000064]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000065]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000066]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  
  hero_hobby[1000068]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000069]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000070]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  hero_hobby[1000071]={1,1.5,1,1,1,1,1,1,1,1,1,1,1.5,1,1,1,1,1,0.5,1,1,1,1,1,2,1,1,1,1,1,1,1,1,1,1,1}
  return hero_hobby
end
CC.hero_hobby = init_hero_hobby()

return CC


